s2.3-symbolic-data.org
#+PROPERTY: header-args  :cache yes
#+PROPERTY: header-args+  :exports both
#+PROPERTY: header-args+  :noweb strip-export
#+TITLE: 2.3 Symbolic Data
#+options: num:nil

Extending the representation from numbers to also include arbitrary symbols.

** 2.3.1 Quotation

How to compound data using symbols? e.g. to obtain lists like
~(a b c d)~
~(23 45 17)~
~((Norah 12) (Molly 9))~

To manipulate symbols, we need the ability to /quote/ a data object.
~(list a b)~ won't work as it will take /values/ of ~a~ and ~b~.

"say your name aloud" vs "say 'your name' aloud".

Scheme's way to quote is to place ' at the beginning of the object to be quoted:
#+begin_src racket
  (define a 1)
  (define b 2)
  (list a b)
  (list 'a 'b)
  (list 'a b)
#+end_src

#+RESULTS[d549289c88cd65e03a1c0fb9ba4a8a8aa3556f92]:
: '(1 2)
: '(a b)
: '(a 2)

Quoting lists:
#+begin_src racket
  #lang sicp
  
  (car '(a b c))
  (cdr '(a b c))
  '()
  nil
#+end_src

#+RESULTS[7017373403f185a920044575d5252129772cf925]:
: a
: (b c)
: ()
: ()

~eq?~ can be used to check if two symbols are the same.

#+name: memq
#+begin_src racket
  (define (memq item x)
    (cond ((null? x) false)
	  ((eq? item (car x)) x)
	  (else (memq item (cdr x)))))

#+end_src

#+RESULTS[a8539e1a53544cf5c9f3adc4ab5c785a7eaef16e]: memq

#+begin_src racket
  <<memq>>
  (memq 'apple '(pear banana prune))
  (memq 'apple '(pear apple banana apple))
#+end_src

#+RESULTS[f32a637e7bdbd3a23446e75202d1f7ee5fff450d]:
: #f
: '(apple banana apple)

**** Exercise 2.53 - quotation practice
#+begin_src racket
  #lang sicp

  (list 'a 'b 'c)  ; => (a b c)
  (list (list 'george))  ; => ((george))
  (cdr '((x1 x2) (y1 y2)))  ; => ((y1 y2))
  (cadr '((x1 x2) (y1 y2)))  ; => (y1 y2)
  (pair? (car '(a short list)))  ; => false
  (memq 'red '((red shoes) (blue socks)))  ; => false
  (memq 'red '(red shoes blue socks))  ; => (red shoes blue socks)
#+end_src

#+RESULTS[0cc9d48ceee62058dc385f625e55f71eafd3c527]:
: (a b c)
: ((george))
: ((y1 y2))
: (y1 y2)
: #f
: #f
: (red shoes blue socks)

**** Exercise 2.54 - ~equal?~ to compare lists

#+begin_src racket
  #lang sicp

  (define (equal? a b)
    (cond ((and (symbol? a) (symbol? b) (eq? a b))
	   true)
	  ((and (null? a) (null? b))
	   true)
	  ((and (list? a)
		(list? b)
		(not (null? a))
		(not (null? b))
		(equal? (car a) (car b))
		(equal? (cdr a) (cdr b)))
	   true)
	  (else
	   false)))

  (equal? 'a 'a)
  (equal? '(a b) '(a b))
  (equal? '(a b) '(a))
  (equal? '(this is a list) '(this is a list))
  (equal? '(this (is a) list) '(this is a list))
#+end_src

#+RESULTS[75da913452c5980b0600802c74e88ba3113a732c]:
: #t
: #t
: #f
: #t
: #f

**** Exercise 2.55

~(car ''abracadabra)~ is the same as ~(car '(quote abracadabra))~ and this should evaluate to ~quote~.

** 2.3.2 Example: symbolic differentiation

Strategy of data abstraction - first define a differentiation algorithm that operates on abstract objects suchs as sums, products and variables, and only afterwards address the representation problem.

*** The differentiation program with abstract data

We will consider a symbolic differentiation program that handle expressions involving addition and multiplication of two variables.

Differentiation of any such expression can be carried out following these reduction rules:

$$\frac{dc}{dx} = 0$$
where $c$ is a constant or a variable different than $x$

$$\frac{dx}{dx} = 1$$

$$\frac{d(u+v)}{dx} = \frac{du}{dx}+\frac{dv}{dx}$$

$$\frac{d(uv)}{dx} = u\left(\frac{dv}{dx}\right) + v\left(\frac{du}{dx}\right)$$

Assume the following are defined:

#+begin_src racket :exports code
  (variable? e)
  (same-variable? v1 v2)
  (sum? e)
  (addend e)
  (augend e)
  (make-sum a1 a2)
  (product? e)
  (multiplier e)
  (multiplicand e)
  (make-product m1 m2)
#+end_src

#+name: deriv-algorithm
#+begin_src racket
  (define (deriv exp var)
    (cond ((number? exp) 0)
	  ((variable? exp)
	   (if (same-variable? exp var) 1 0))
	  ((sum? exp)
	   (make-sum (deriv (addend exp) var)
		     (deriv (augend exp) var)))
	  ((product? exp)
	   (make-sum (make-product
		      (multiplier exp)
		      (deriv (multiplicand exp) var))
		     (make-product
		      (deriv (multiplier exp) var)
		      (multiplicand exp))))
	  ; Exercise 2.56
	  ((and (exponentiation? exp) (number? (exponent exp)))
	   (make-product
	    (exponent exp)
	    (make-product
	     (make-exponentiation (base exp) (- (exponent exp) 1))
	     (deriv (base exp) var))))
	  (else
	   (error "unknown expression type -- deriv" exp))))

#+end_src

