s2.3-symbolic-data.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-11 Sun 22:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2.3 Symbolic Data</title>
<meta name="author" content="LMG" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">2.3 Symbolic Data</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org133c67b">2.3.1 Quotation</a>
<ul>
<li>
<ul>
<li><a href="#org15dff4a">Exercise 2.53 - quotation practice</a></li>
<li><a href="#org389d387">Exercise 2.54 - <code>equal?</code> to compare lists</a></li>
<li><a href="#orge3626a3">Exercise 2.55</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd3a9d3c">2.3.2 example: symbolic differentiation</a>
<ul>
<li><a href="#org09f2087">the differentiation program with abstract data</a></li>
<li><a href="#orgf4d59e5">Representing algebraic expression</a>
<ul>
<li><a href="#orge026eba">Exercise 2.58a - constructors and selectors for the fully parenthesised infix notation</a></li>
<li><a href="#orge2ac68f">Exercise 2.58a - constructors and selectors for the partially parenthesised infix notation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org36c38a2">2.3.3 Example: Representing Sets</a>
<ul>
<li><a href="#org7a0c55a">Sets as unordered lists</a>
<ul>
<li><a href="#orgbcadd4d">Exercise 2.59 - <code>union-set</code></a></li>
<li><a href="#org5e9c025">Exercise 2.60 - <code>sets-interface-list-with-duplicates</code></a></li>
</ul>
</li>
<li><a href="#org8b6254b">Sets as ordered lists</a></li>
<li><a href="#orgcf1605e">Sets as binary trees</a>
<ul>
<li><a href="#org78fdc27">Exercise 2.63 - <code>tree-&gt;list</code></a></li>
<li><a href="#orgf9d02e5">Exercise 2.64 - <code>list-&gt;tree</code></a></li>
<li><a href="#org40293f2">Exercise 2.65 - <code>union-set</code> and <code>intersection-set</code></a></li>
</ul>
</li>
<li><a href="#org0883d60">Sets and information retrieval</a>
<ul>
<li><a href="#org9ba1034">Exercise 2.66 - <code>lookup</code> for the set representation based on binary tree</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4b57b34">2.3.4 Example: Huffman Encoding Trees</a>
<ul>
<li><a href="#org97db93a">Generating Huffman trees</a></li>
<li><a href="#org7368eab">Representing Huffman trees</a></li>
<li><a href="#orgb66e8ab">The decoding procedure</a></li>
<li><a href="#orge87ae28">Set of weighted-elements</a></li>
<li><a href="#org6eaeca2">Exercise 2.67 - run <code>decode</code></a></li>
<li><a href="#org88db90c">Exercise 2.68 - <code>encode</code></a></li>
<li><a href="#orga18f6c2">Exercise 2.69 - <code>generate-huffman-tree</code></a></li>
<li><a href="#org3a79e46">Exercise 2.70 - check it out</a></li>
<li><a href="#org0a854bb">Exercise 2.71 - frequencies in geometric progression</a></li>
<li><a href="#org4be9911">Exercise 2.72 - order of growth of <code>encode</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Extending the representation from numbers to also include arbitrary symbols.
</p>

<div id="outline-container-org133c67b" class="outline-2">
<h2 id="org133c67b">2.3.1 Quotation</h2>
<div class="outline-text-2" id="text-org133c67b">
<p>
How to compound data using symbols? e.g. to obtain lists like
<code>(a b c d)</code>
<code>(23 45 17)</code>
<code>((Norah 12) (Molly 9))</code>
</p>

<p>
To manipulate symbols, we need the ability to <i>quote</i> a data object.
<code>(list a b)</code> won't work as it will take <i>values</i> of <code>a</code> and <code>b</code>.
</p>

<p>
"say your name aloud" vs "say 'your name' aloud".
</p>

<p>
Scheme's way to quote is to place ' at the beginning of the object to be quoted:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define a 1)
(define b 2)
(list a b)
(list 'a 'b)
(list 'a b)
</pre>
</div>

<pre class="example">
'(1 2)
'(a b)
'(a 2)
</pre>


<p>
Quoting lists:
</p>
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(car '(a b c))
(cdr '(a b c))
'()
nil
</pre>
</div>

<pre class="example">
a
(b c)
()
()
</pre>


<p>
<code>eq?</code> can be used to check if two symbols are the same.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org74af236">(define (memq item x)
  (cond ((null? x) false)
	((eq? item (car x)) x)
	(else (memq item (cdr x)))))

</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">
(memq 'apple '(pear banana prune))
(memq 'apple '(pear apple banana apple))
</pre>
</div>

<pre class="example">
#f
'(apple banana apple)
</pre>
</div>

<div id="outline-container-org15dff4a" class="outline-4">
<h4 id="org15dff4a">Exercise 2.53 - quotation practice</h4>
<div class="outline-text-4" id="text-org15dff4a">
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(list 'a 'b 'c)  ; =&gt; (a b c)
(list (list 'george))  ; =&gt; ((george))
(cdr '((x1 x2) (y1 y2)))  ; =&gt; ((y1 y2))
(cadr '((x1 x2) (y1 y2)))  ; =&gt; (y1 y2)
(pair? (car '(a short list)))  ; =&gt; false
(memq 'red '((red shoes) (blue socks)))  ; =&gt; false
(memq 'red '(red shoes blue socks))  ; =&gt; (red shoes blue socks)
</pre>
</div>

<pre class="example">
(a b c)
((george))
((y1 y2))
(y1 y2)
#f
#f
(red shoes blue socks)
</pre>
</div>
</div>

<div id="outline-container-org389d387" class="outline-4">
<h4 id="org389d387">Exercise 2.54 - <code>equal?</code> to compare lists</h4>
<div class="outline-text-4" id="text-org389d387">
<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (equal? a b)
  (cond ((and (symbol? a) (symbol? b) (eq? a b))
	 true)
	((and (null? a) (null? b))
	 true)
	((and (list? a)
	      (list? b)
	      (not (null? a))
	      (not (null? b))
	      (equal? (car a) (car b))
	      (equal? (cdr a) (cdr b)))
	 true)
	(else
	 false)))

(equal? 'a 'a)
(equal? '(a b) '(a b))
(equal? '(a b) '(a))
(equal? '(this is a list) '(this is a list))
(equal? '(this (is a) list) '(this is a list))
</pre>
</div>

<pre class="example">
#t
#t
#f
#t
#f
</pre>
</div>
</div>

<div id="outline-container-orge3626a3" class="outline-4">
<h4 id="orge3626a3">Exercise 2.55</h4>
<div class="outline-text-4" id="text-orge3626a3">
<p>
<code>(car ''abracadabra)</code> is the same as <code>(car '(quote abracadabra))</code> and this should evaluate to <code>quote</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd3a9d3c" class="outline-2">
<h2 id="orgd3a9d3c">2.3.2 example: symbolic differentiation</h2>
<div class="outline-text-2" id="text-orgd3a9d3c">
<p>
strategy of data abstraction - first define a differentiation algorithm that operates on abstract objects suchs as sums, products and variables, and only afterwards address the representation problem.
</p>
</div>

<div id="outline-container-org09f2087" class="outline-3">
<h3 id="org09f2087">the differentiation program with abstract data</h3>
<div class="outline-text-3" id="text-org09f2087">
<p>
we will consider a symbolic differentiation program that handle expressions involving addition and multiplication of two variables.
</p>

<p>
differentiation of any such expression can be carried out following these reduction rules:
</p>

<p>
\[\frac{dc}{dx} = 0\]
where \(c\) is a constant or a variable different than \(x\)
</p>

<p>
\[\frac{dx}{dx} = 1\]
</p>

<p>
\[\frac{d(u+v)}{dx} = \frac{du}{dx}+\frac{dv}{dx}\]
</p>

<p>
\[\frac{d(uv)}{dx} = u\left(\frac{dv}{dx}\right) + v\left(\frac{du}{dx}\right)\]
</p>

<p>
assume the following are defined:
</p>
<div class="org-src-container">
<pre class="src src-racket" id="orgb24207e">(define (deriv exp var)
  (cond ((number? exp) 0)
	((variable? exp)
	 (if (same-variable? exp var) 1 0))
	((sum? exp)
	 (make-sum (deriv (addend exp) var)
		   (deriv (augend exp) var)))
	((product? exp)
	 (make-sum (make-product
		    (multiplier exp)
		    (deriv (multiplicand exp) var))
		   (make-product
		    (deriv (multiplier exp) var)
		    (multiplicand exp))))
	; Exercise 2.56
	((and (exponentiation? exp) (number? (exponent exp)))
	 (make-product
	  (exponent exp)
	  (make-product
	   (make-exponentiation (base exp) (- (exponent exp) 1))
	   (deriv (base exp) var))))
	(else
	 (error "unknown expression type -- deriv" exp))))

</pre>
</div>

<pre class="example">
/var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-vnKy6L/ob-racketuB7lG2.rkt:5:10: variable?: unbound identifier
  in: variable?
  location...:
   /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-vnKy6L/ob-racketuB7lG2.rkt:5:10
</pre>


<div class="org-src-container">
<pre class="src src-racket">(variable? e)
(same-variable? v1 v2)
(sum? e)
(addend e)
(augend e)
(make-sum a1 a2)
(product? e)
(multiplier e)
(multiplicand e)
(make-product m1 m2)
</pre>
</div>
</div>
</div>
