s2.3-symbolic-data.org
*** Representing algebraic expression

Use parenthesised prefix notation (as in Lisp) to represent algebraic expressions:

#+name: deriv-primitives
#+begin_src racket :exports code
  (define (variable? x) (symbol? x))
  (define (same-variable? v1 v2) (and (variable? v1) (variable? v2) (eq? v1 v2)))

  (define (=number? exp num)
    (and (number? exp) (= exp num)))

  ; (define (make-sum a1 a2) (list '+ a1 a2))
  (define (make-sum a1 . as)
    (cond
      ((null? as)
       a1)
      ((null? (cdr as))
       (let ((a2 (car as)))
	 (cond ((=number? a1 0) a2)
	       ((=number? a2 0) a1)
	       ((and (number? a1) (number? a2)) (+ a1 a2))
	       (else (list '+ a1 a2)))))
      (else
       (make-sum a1
		 (apply make-sum as)))))
  (define (sum? x) (and (pair? x) (eq? (car x) '+)))
  (define (addend s) (cadr s))
  (define (augend s)
    (cond
      ((= (length s) 2) 0)
      ((= (length s) 3) (caddr s))
      (else
       (make-sum (caddr s)
		 (apply make-sum (cdddr s))))))

  ; (define (make-product m1 m2) (list '* m1 m2))
  (define (make-product m1 . ms)
    (cond
      ((= (length ms) 0) m1)
      ((= (length ms) 1)
       (let ((m2 (car ms)))
	 (cond ((or (=number? m1 0) (=number? m2 0)) 0)
	       ((=number? m1 1) m2)
	       ((=number? m2 1) m1)
	       ((and (number? m1) (number? m2)) (* m1 m2))
	       (else (list '* m1 m2)))))
      (else
       (make-product m1
		     (apply make-product (cdr ms))))))
  (define (product? x) (and (pair? x) (eq? (car x) '*)))
  (define (multiplier p) (cadr p))
  (define (multiplicand p)
    (cond ((= (length p) 2)
	   1)
	  ((= (length p) 3)
	   (caddr p))
	  (else
	   (make-product (caddr p)
			 (apply make-product (cdddr p))))))

  ; Exercise 2.56
  (define (make-exponentiation b e)
    (cond ((=number? e 0) 1)
	  ((=number? e 1) b)
	  (else (list '** b e))))
  (define (exponentiation? x) (and (pair? x) (eq? (car x) '**)))
  (define (base x) (cadr x))
  (define (exponent x) (caddr x))
#+end_src

#+RESULTS[de34cbcbcb0cf949d079b25a73f81e4e0dade7f1]: deriv-primitives

Examples

#+begin_src racket :noweb yes
  #lang sicp
  <<deriv-algorithm>>
  <<deriv-primitives>>

  (deriv '(+ x 3) 'x)
  (deriv '(* x y) 'x)
  (deriv '(* (* x y) (+ x 3)) 'x)

  ; Exercise 2.56
  (deriv '(** x 2) 'x)
  (deriv '(** x 3) 'x)
  (deriv '(* 14 (** x 3)) 'x)

  ; Exercise 2.57
  (deriv '(+ x x x) 'x)
  (deriv '(* x x x x) 'x)
#+end_src

#+RESULTS[b660b5626db8e37525e10408b91d84c59014d14b]:
: 1
: y
: (+ (* x y) (* y (+ x 3)))
: (* 2 x)
: (* 3 (** x 2))
: (* 14 (* 3 (** x 2)))
: 3
: (+ (* x (+ (* x (+ x x)) (* x x))) (* x (* x x)))

**** Exercise 2.58a - constructors and selectors for the fully parenthesised infix notation

Assume that + and * always take two arguments and that expressions are fully parenthesized

#+name: deriv-primitives-infix
#+begin_src racket :exports code
  (define (variable? x) (symbol? x))
  (define (same-variable? v1 v2)
    (and (variable? v1)
	 (variable? v2)
	 (eq? v1 v2)))

  (define (=number? x n)
    (and (number? x) (= x n)))

  (define (make-sum a1 a2)
    (cond ((=number? a1 0) a2)
	  ((=number? a2 0) a1)
	  ((and (number? a1) (number? a2)) (+ a1 a2))
	  (else (list a1 '+ a2))))
  (define (sum? x) (and (pair? x) (eq? (cadr x) '+)))
  (define (addend s) (car s))
  (define (augend s) (caddr s))

  (define (make-product m1 m2)
    (cond ((or (=number? m1 0) (=number? m2 0)) 0)
	  ((=number? m1 1) m2)
	  ((=number? m2 1) m1)
	  ((and (number? m1) (number? m2)) (* m1 m2))
	  (else (list m1 '* m2))))
  (define (product? x) (and (pair? x) (eq? (cadr x) '*)))
  (define (multiplier p) (car p))
  (define (multiplicand p) (caddr p))


  (define (make-exponentiation b e)
    (cond ((=number? e 0) 1)
	  ((=number? e 1) b)
	  (else (list b '** e))))
  (define (exponentiation? x) (and (pair? x) (eq? (cadr x) '**)))
  (define (base x) (car x))
  (define (exponent x) (caddr x))
#+end_src

#+RESULTS[b9fe1decd63396fe27a1b1d2e33e040f4d06908f]: deriv-primitives-infix

Looks good:
#+begin_src racket
  #lang sicp
  <<deriv-algorithm>>
  <<deriv-primitives-infix>>

  (deriv '(x + 3) 'x)
  (deriv '(x * y) 'x)
  (deriv '((x * y) * (x * 3)) 'x)
  (deriv '((x * y) * (x ** 3)) 'x)
#+end_src

#+RESULTS[559fd549979f1d5512297da747858e7765702d33]:
: 1
: y
: (((x * y) * 3) + (y * (x * 3)))
: (((x * y) * (3 * (x ** 2))) + (y * (x ** 3)))

