s2.3-symbolic-data.org
**** Exercise 2.58a - constructors and selectors for the partially parenthesised infix notation

~(x + 3 * (x + y + 2))~

#+name: deriv-primitives-infix-2
#+begin_src racket :exports none
  (define (filter pred xs)
    (cond ((null? xs) nil)
	  ((pred (car xs))
	   (cons (car xs) (filter pred (cdr xs))))
	  (else
	   (filter pred (cdr xs)))))

  (define (accumulate op init xs)
    (if (null? xs)
	init
	(op (car xs)
	    (accumulate op init (cdr xs)))))

  (define (sum xs)
    (accumulate + 0 xs))

  (define (multiply xs)
    (accumulate * 1 xs))

  (define (=number? x n)
    (and (number? x) (= x n)))

  (define (intersperce xs joint)
    (cond ((null? xs) nil)
	  ((null? (cdr xs)) xs)
	  (else (append (list (car xs) joint)
			(intersperce (cdr xs) joint)))))

  (define (collect-numbers xs)
    (filter number? xs))

  (define (collect-non-numbers xs)
    (filter (lambda (x) (not (number? x))) xs))

  (define (split-at-sym xs s)
    (define (iter left right)
      (cond ((null? right)
	     (cons left right))
	    ((eq? (car right) s)
	     (cons left (cdr right)))
	    (else
	     (iter (append left (list (car right)))
		   (cdr right)))))
    (iter '() xs))

  (define (parse-product expr)
    (split-at-sym expr '+))

  (define (expand-single x)
    (cond ((not (pair? x)) x)
	  ((null? x) 0)
	  ((null? (cdr x)) (car x))
	  (else x)))

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;


  (define (variable? x) (symbol? x))
  (define (same-variable? v1 v2)
    (and (variable? v1)
	 (variable? v2)
	 (eq? v1 v2)))

  (define (make-sum . xs)
    (expand-single
     (cond ((null? xs) 0)
	   (else
	    (let ((c (sum (collect-numbers xs))))
	      (let ((terms (cond
			     ((zero? c)
			      (collect-non-numbers xs))
			     (else
			      (cons c (collect-non-numbers xs))))))
		(intersperce terms '+)))))))

  (define (sum? expr)
    (not (null? (filter (lambda (t) (eq? t '+))
			expr))))

  (define (addend expr)
    (expand-single
     (cond ((null? (cdr expr))
	    (car expr))
	   ((eq? (cadr expr)
		 '+)
	    (car expr))
	   ((eq? (cadr expr)
		 '*)
	    (car (parse-product expr)))
	   (else
	    (error "Unknown expression -- ADDEND" expr)))))

  (define (augend expr)
    (expand-single (cond ((eq? (cadr expr)
		 '+)
	    (cddr expr))
	   ((eq? (cadr expr)
		 '*)
	    (cdr (parse-product expr)))
	   (else
	    (error "Unknown expression -- AUGEND" expr)))))

  (define (make-product . xs)
    (expand-single
     (cond ((null? xs) 1)
	   (else
	    (let ((c (multiply (collect-numbers xs))))
	      (let ((terms (cond ((= 0 c)
				  (list 0))
				 ((= 1 c)
				  (collect-non-numbers xs))
				 (else
				  (cons c (collect-non-numbers xs))))))
		(intersperce terms '*)))))))

  (define (product? expr)
    (and (> (length expr) 1)
	 (null? (filter (lambda (t) (eq? t '+))
			expr))))

  (define (multiplier expr)
    (expand-single
     (cond ((null? (cdr expr))
	    (car expr))
	   ((eq? (cadr expr)
		 '*)
	    (car expr))
	   (else
	    expr))))

  (define (multiplicand expr)
    (expand-single
     (cond ((eq? (cadr expr)
		 '*)
	    (expand-single (cddr expr)))
	   (else
	    (error "Unknown expression -- MULTIPLICAND" expr)))))

  (define (make-exponentiation b e)
    (cond ((=number? e 0) 1)
	  ((=number? e 1) b)
	  (else (list b '** e))))
  (define (exponentiation? x) (and (pair? x) (eq? (cadr x) '**)))
  (define (base x) (car x))
  (define (exponent x) (caddr x))
#+end_src

#+RESULTS[51854b0707528c62fae90df00bea9893ccf1e025]: deriv-primitives-infix-2
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-DV1tZm/ob-racket1UZAsu.rkt:4:20: nil: unbound identifier
:   in: nil
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-DV1tZm/ob-racket1UZAsu.rkt:4:20


#+begin_src racket -n 1 :noweb yes
  #lang sicp
n
  <<deriv-primitives-infix-2>>  
  <<deriv-algorithm>>

  (deriv '(x + 3) 'x)
  (deriv '(x * y) 'x)
  (deriv '((x * y) * (3 * x)) 'x)
  (deriv '(x * y * 3 * x) 'x)
  (deriv '(x * (3 * y) * x) 'x)
  
#+end_src

#+RESULTS[24b15acb9a04b827f8c4512836bb66a7693412b6]:
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-lSuimp/ob-racketMsaYTW.rkt:3:0: n: unbound identifier
:   in: n
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-lSuimp/ob-racketMsaYTW.rkt:3:0

Derivative algorithm still works (exponentiation is not supported)! But the output is not obvious again 

Notes
- this exercise need more time to design and test properly that I'm not willing to take in favor of broader coverage. I expect a lot of mistakes in this version
- parsing is designed after existing constructor/selectors interface
- precedence of * over + is implemented in addend
- collect constants in constructors into a single constant
- any of addend/augend/multiplier/multiplicand can be either (), (x), or (x1 # x2 # ...), this should be accounted for 
- I don't know how to debug this - in this env debugging needs to happen beforehand, in a good design it seems
- For the results to be more intelligible, constructors should also expand nested terms of the same precedence e.g. ~(x * (3 * y)~ => ~(3 * x * y)~
- consider bringing user input expression to some standardized representation

