s2.3-symbolic-data.org
** 2.3.3 Example: Representing Sets

Informally, a set is a collection of distinct objects.

To give a more precise definition, use data abstraction:
#+begin_src racket :exports code
  union-set
  intersection-set
  element-of-set?
  adjoint-set
#+end_src

#+RESULTS[50cec63fd834fcbb9c20c56370329897cdafdf6d]:
: /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-psuURg/ob-racketG4Asmr.rkt:3:0: union-set: unbound identifier
:   in: union-set
:   location...:
:    /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-psuURg/ob-racketG4Asmr.rkt:3:0

*** Sets as unordered lists

Set is represented as a list where no element is presented more than once

#+name: sets-interface-unordered-list
#+begin_src racket
  (define (element-of-set? x set)
    (cond ((null? set) false)
	  ((equal? x (car set)) true)
	  (else (element-of-set? x (cdr set)))))

  (define (adjoint-set x set)
    (if (element-of-set? x set)
	set
	(cons x set)))

  ;; element-of-set? has time complexity of O(n), and so intersection-set has O(n^2)
  (define (intersection-set set1 set2)
    (cond ((or (null? set1) (null? set2)) '())
	  ((element-of-set? (car set1) set2)
	   (cons (car set1)
		 (intersection-set (cdr set1) set2)))
	  (else
	   (intersection-set (cdr set1) set2))))

  ;; Exercise 2.59
  (define (union-set set1 set2)
    (cond ((null? set1) set2)
	  ((null? set2) set1)
	  ((element-of-set? (car set1) set2)
	   (union-set (cdr set1) set2))
	  (else
	   (cons (car set1)
		 (union-set (cdr set1) set2)))))
#+end_src

#+RESULTS[7822dfcb6ffd023d68764c615119bbeea09eaed2]: sets-interface-unordered-list

**** Exercise 2.59 - ~union-set~

~union-set~ is similar in recursive structure to ~intersection-set~:
- if either of sets is empty, the result is the other set
- if (car set1) is in set2, then don't include it again
- if (car set1) is not in set2, then it should be included in the result

#+begin_src racket
  #lang sicp

  <<sets-interface-unordered-list>>

  (define s1 '(1 2 3 4))
  (define s2 '(2 4 5 6))
  (adjoint-set 4 s1)
  (adjoint-set 5 s1)
  (element-of-set? 4 s1)
  (element-of-set? 5 s1)
  (union-set s1 s2)
  (intersection-set s1 s2)
#+end_src

#+RESULTS[4a708427e5c37c267431e32f23c35a630655c8ee]:
: (1 2 3 4)
: (5 1 2 3 4)
: #t
: #f
: (1 3 2 4 5 6)
: (2 4)

**** Exercise 2.60 - ~sets-interface-list-with-duplicates~

Suppose the set is represented using a list with duplicates.
~element-of-set?~ and ~intersection-set~ would be the same.
~adjoint-set~ and ~union-set~ are different however:
- ~adjoint-set~ now does not have to respect "no duplicates" rule, can just ~cons~ a new list
- similarly ~union-set~ can be just a combination of two sets

| Operation          | Comment                                                | Complexity                                                  |
|--------------------+--------------------------------------------------------+-------------------------------------------------------------|
| ~element-of-set?~  | Can remain the same                                    | $O(n*e)$, where $e$ is the expected duplication             |
| ~adjoint-set~      | No need to respect "no dupes" rule, ~cons~ new element | $O(1)$                                                      |
| ~intersection-set~ | Can remain the same                                    | $O(n*m)$, where $n$ and $m$ are the cardinality of two sets |
| ~union-set~        | No need to respect "no dupes" rule, ~append~ two sets  | Whatever complexity of ~append~ is, likely $O(n)$           |

One interesting property of new ~adjoint-set~ is that most recent elements are close to the start of the list, meaning that applications that check ~element-of-set?~ for recent values need not check all $n$ elements, and will have better average running time. Combined with constant running time of ~adjoint-set~ itself, the profile of applications that could benefit from the new representation is as follows:
- frequently calls ~adjoint-set~ (but not frequently enough to exhaust memory, although this may be addressed with occasional deduplication)
- frequently calls ~element-of-set?~ with recently added values
- may call ~union-set~, with potential "optimization" to use the set with more recent values as the first argument to optimize future ~element-of-set?~ checks
- infrequent calls to ~intersection-set~, as it remains of quadratic running time

#+begin_src racket
  #lang sicp

  (define (element-of-set? x set)
    (cond ((null? set) false)
	  ((equal? (car set) x) true)
	  (else (element-of-set? x (cdr set)))))

  (define (adjoint-set x set)
    (cons x set))

  (define (union-set set1 set2)
    (append set1 set2))

  (define (intersection-set set1 set2)
    (cond ((or (null? set1) (null? set2)) '())
	  ((element-of-set? (car set1) set2)
	   (cons (car set1)
		 (intersection-set (cdr set1) set2)))
	  (else
	   (intersection-set (cdr set1) set2))))

  (union-set '(1 2 3) '(3 4 4))
  (intersection-set '(1 2 3 3) '(2 2 2 2 3))
#+end_src

#+RESULTS[0f39db022007635034a81b33ce374dcccf52c244]:
: (1 2 3 3 4 4)
: (2 3 3)

*** Sets as ordered lists

Keep elements of set in a list in an increasing order, e.g. {1, 3, 6, 10} would be (1 3 6 10).

#+name: sets-interface-ordered-lists
#+begin_src racket
  (define (element-of-set? x set)
    (cond ((null? set) false)
	  ((> (car set) x) false)
	  ((= (car set) x) true)
	  (else (element-of-set? x (cdr set)))))

  ;; Exercise 2.61
  ;; Similarly to element-of-set?, on a diverse set of x adjoint-set will stop early, about n/2 on average
  (define (adjoint-set x set)
    (cond ((null? set) (list x))
	  ((< x (car set)) (cons x set))
	  ((= x (car set)) set)
	  ((> x (car set))
	   (cons (car set)
		 (adjoint-set x (cdr set))))))

  (define (intersection-set set1 set2)
    (if (or (null? set1) (null? set2))
	'()
	(let ((x1 (car set1))
	      (x2 (car set2)))
	  (cond ((= x1 x2)
		 (cons x1 (intersection-set (cdr set1) (cdr set2))))
		((< x1 x2)
		 (intersection-set (cdr set1) set2))
		((> x1 x2)
		 (intersection-set set1 (cdr set2)))))))

  ;; Exercise 2.62
  (define (union-set set1 set2)
    (cond ((null? set1) set2)
	  ((null? set2) set1)
	  (else
	   (let ((x1 (car set1))
		 (x2 (car set2)))
	     (cond ((= x1 x2)
		    (cons x1 (union-set (cdr set1) (cdr set2))))
		   ((< x1 x2)
		    (cons x1 (union-set (cdr set1) set2)))
		   ((> x1 x2)
		    (cons x2 (union-set set1 (cdr set2)))))))))
#+end_src

#+RESULTS[483cd3967ac99f9d243cbf5c7cf2c38ef71efaf9]: sets-interface-ordered-lists

#+begin_src racket
  #lang sicp
  <<sets-interface-ordered-lists>>

  (element-of-set? 1 '(1 2 3 4))
  (element-of-set? 4 '(1 2 3 4))
  (element-of-set? 3 '(1 2 4 5))
  (element-of-set? 6 '(1 2 4 5))
  (adjoint-set 1 '())
  (adjoint-set 1 '(2 3 4))
  (adjoint-set 3 '(1 2 4))
  (adjoint-set 4 '(1 2 3))
  (intersection-set '(1 2 4 6) '(2 3 4 5))
  (union-set '() '(1 2 3))
  (union-set '(1 2 3) '())
  (union-set '(1 2 3) '(1 2 3))
  (union-set '(1 3 5) '(2 4 6))
  (union-set '(6) '(1 2 3 4 5))
  (union-set '(6) '(1 2 3 4 5 6))
#+end_src

#+RESULTS[e7c15f82dbc5dd30abb530d700fcc7dba9d6c13c]:
#+begin_example
#t
#t
#f
#f
(1)
(1 2 3 4)
(1 2 3 4)
(1 2 3 4)
(2 4)
(1 2 3)
(1 2 3)
(1 2 3)
(1 2 3 4 5 6)
(1 2 3 4 5 6)
(1 2 3 4 5 6)
#+end_example

