s2.3-symbolic-data.html

<div id="outline-container-org36c38a2" class="outline-2">
<h2 id="org36c38a2">2.3.3 Example: Representing Sets</h2>
<div class="outline-text-2" id="text-org36c38a2">
<p>
Informally, a set is a collection of distinct objects.
</p>

<p>
To give a more precise definition, use data abstraction:
</p>
<div class="org-src-container">
<pre class="src src-racket">union-set
intersection-set
element-of-set?
adjoint-set
</pre>
</div>
</div>

<div id="outline-container-org7a0c55a" class="outline-3">
<h3 id="org7a0c55a">Sets as unordered lists</h3>
<div class="outline-text-3" id="text-org7a0c55a">
<p>
Set is represented as a list where no element is presented more than once
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgb4b2eba">(define (element-of-set? x set)
  (cond ((null? set) false)
	((equal? x (car set)) true)
	(else (element-of-set? x (cdr set)))))

(define (adjoint-set x set)
  (if (element-of-set? x set)
      set
      (cons x set)))

;; element-of-set? has time complexity of O(n), and so intersection-set has O(n^2)
(define (intersection-set set1 set2)
  (cond ((or (null? set1) (null? set2)) '())
	((element-of-set? (car set1) set2)
	 (cons (car set1)
	       (intersection-set (cdr set1) set2)))
	(else
	 (intersection-set (cdr set1) set2))))

;; Exercise 2.59
(define (union-set set1 set2)
  (cond ((null? set1) set2)
	((null? set2) set1)
	((element-of-set? (car set1) set2)
	 (union-set (cdr set1) set2))
	(else
	 (cons (car set1)
	       (union-set (cdr set1) set2)))))
</pre>
</div>
</div>

<div id="outline-container-orgbcadd4d" class="outline-4">
<h4 id="orgbcadd4d">Exercise 2.59 - <code>union-set</code></h4>
<div class="outline-text-4" id="text-orgbcadd4d">
<p>
<code>union-set</code> is similar in recursive structure to <code>intersection-set</code>:
</p>
<ul class="org-ul">
<li>if either of sets is empty, the result is the other set</li>
<li>if (car set1) is in set2, then don't include it again</li>
<li>if (car set1) is not in set2, then it should be included in the result</li>
</ul>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp



(define s1 '(1 2 3 4))
(define s2 '(2 4 5 6))
(adjoint-set 4 s1)
(adjoint-set 5 s1)
(element-of-set? 4 s1)
(element-of-set? 5 s1)
(union-set s1 s2)
(intersection-set s1 s2)
</pre>
</div>

<pre class="example">
(1 2 3 4)
(5 1 2 3 4)
#t
#f
(1 3 2 4 5 6)
(2 4)
</pre>
</div>
</div>

<div id="outline-container-org5e9c025" class="outline-4">
<h4 id="org5e9c025">Exercise 2.60 - <code>sets-interface-list-with-duplicates</code></h4>
<div class="outline-text-4" id="text-org5e9c025">
<p>
Suppose the set is represented using a list with duplicates.
<code>element-of-set?</code> and <code>intersection-set</code> would be the same.
<code>adjoint-set</code> and <code>union-set</code> are different however:
</p>
<ul class="org-ul">
<li><code>adjoint-set</code> now does not have to respect "no duplicates" rule, can just <code>cons</code> a new list</li>
<li>similarly <code>union-set</code> can be just a combination of two sets</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Operation</th>
<th scope="col" class="org-left">Comment</th>
<th scope="col" class="org-left">Complexity</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>element-of-set?</code></td>
<td class="org-left">Can remain the same</td>
<td class="org-left">\(O(n*e)\), where \(e\) is the expected duplication</td>
</tr>

<tr>
<td class="org-left"><code>adjoint-set</code></td>
<td class="org-left">No need to respect "no dupes" rule, <code>cons</code> new element</td>
<td class="org-left">\(O(1)\)</td>
</tr>

<tr>
<td class="org-left"><code>intersection-set</code></td>
<td class="org-left">Can remain the same</td>
<td class="org-left">\(O(n*m)\), where \(n\) and \(m\) are the cardinality of two sets</td>
</tr>

<tr>
<td class="org-left"><code>union-set</code></td>
<td class="org-left">No need to respect "no dupes" rule, <code>append</code> two sets</td>
<td class="org-left">Whatever complexity of <code>append</code> is, likely \(O(n)\)</td>
</tr>
</tbody>
</table>

<p>
One interesting property of new <code>adjoint-set</code> is that most recent elements are close to the start of the list, meaning that applications that check <code>element-of-set?</code> for recent values need not check all \(n\) elements, and will have better average running time. Combined with constant running time of <code>adjoint-set</code> itself, the profile of applications that could benefit from the new representation is as follows:
</p>
<ul class="org-ul">
<li>frequently calls <code>adjoint-set</code> (but not frequently enough to exhaust memory, although this may be addressed with occasional deduplication)</li>
<li>frequently calls <code>element-of-set?</code> with recently added values</li>
<li>may call <code>union-set</code>, with potential "optimization" to use the set with more recent values as the first argument to optimize future <code>element-of-set?</code> checks</li>
<li>infrequent calls to <code>intersection-set</code>, as it remains of quadratic running time</li>
</ul>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp

(define (element-of-set? x set)
  (cond ((null? set) false)
	((equal? (car set) x) true)
	(else (element-of-set? x (cdr set)))))

(define (adjoint-set x set)
  (cons x set))

(define (union-set set1 set2)
  (append set1 set2))

(define (intersection-set set1 set2)
  (cond ((or (null? set1) (null? set2)) '())
	((element-of-set? (car set1) set2)
	 (cons (car set1)
	       (intersection-set (cdr set1) set2)))
	(else
	 (intersection-set (cdr set1) set2))))

(union-set '(1 2 3) '(3 4 4))
(intersection-set '(1 2 3 3) '(2 2 2 2 3))
</pre>
</div>

<pre class="example">
(1 2 3 3 4 4)
(2 3 3)
</pre>
</div>
</div>
</div>

<div id="outline-container-org8b6254b" class="outline-3">
<h3 id="org8b6254b">Sets as ordered lists</h3>
<div class="outline-text-3" id="text-org8b6254b">
<p>
Keep elements of set in a list in an increasing order, e.g. {1, 3, 6, 10} would be (1 3 6 10).
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orgdce5b79">(define (element-of-set? x set)
  (cond ((null? set) false)
	((&gt; (car set) x) false)
	((= (car set) x) true)
	(else (element-of-set? x (cdr set)))))

;; Exercise 2.61
;; Similarly to element-of-set?, on a diverse set of x adjoint-set will stop early, about n/2 on average
(define (adjoint-set x set)
  (cond ((null? set) (list x))
	((&lt; x (car set)) (cons x set))
	((= x (car set)) set)
	((&gt; x (car set))
	 (cons (car set)
	       (adjoint-set x (cdr set))))))

(define (intersection-set set1 set2)
  (if (or (null? set1) (null? set2))
      '()
      (let ((x1 (car set1))
	    (x2 (car set2)))
	(cond ((= x1 x2)
	       (cons x1 (intersection-set (cdr set1) (cdr set2))))
	      ((&lt; x1 x2)
	       (intersection-set (cdr set1) set2))
	      ((&gt; x1 x2)
	       (intersection-set set1 (cdr set2)))))))

;; Exercise 2.62
(define (union-set set1 set2)
  (cond ((null? set1) set2)
	((null? set2) set1)
	(else
	 (let ((x1 (car set1))
	       (x2 (car set2)))
	   (cond ((= x1 x2)
		  (cons x1 (union-set (cdr set1) (cdr set2))))
		 ((&lt; x1 x2)
		  (cons x1 (union-set (cdr set1) set2)))
		 ((&gt; x1 x2)
		  (cons x2 (union-set set1 (cdr set2)))))))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp


(element-of-set? 1 '(1 2 3 4))
(element-of-set? 4 '(1 2 3 4))
(element-of-set? 3 '(1 2 4 5))
(element-of-set? 6 '(1 2 4 5))
(adjoint-set 1 '())
(adjoint-set 1 '(2 3 4))
(adjoint-set 3 '(1 2 4))
(adjoint-set 4 '(1 2 3))
(intersection-set '(1 2 4 6) '(2 3 4 5))
(union-set '() '(1 2 3))
(union-set '(1 2 3) '())
(union-set '(1 2 3) '(1 2 3))
(union-set '(1 3 5) '(2 4 6))
(union-set '(6) '(1 2 3 4 5))
(union-set '(6) '(1 2 3 4 5 6))
</pre>
</div>

<pre class="example" id="org095b1c8">
#t
#t
#f
#f
(1)
(1 2 3 4)
(1 2 3 4)
(1 2 3 4)
(2 4)
(1 2 3)
(1 2 3)
(1 2 3)
(1 2 3 4 5 6)
(1 2 3 4 5 6)
(1 2 3 4 5 6)
</pre>
</div>
</div>
