s2.3-symbolic-data.org
*** Sets as binary trees

Each node of the tree holds one element of the set, the "entry" of that node, and links to other two nodes, possibly empty.
The "left" node's entry is smaller than the node's "entry", and the "right" node's entry is larger.

Because every node has left and right, each represents a tree with two subtrees, with left subree holding elements smaller than node's entry, and right holding elements larger thant node's entry.

Benefit of the tree structure is that when searching a tree for the element ~, at each node ~x~ is either equal, smaller or greater than the entry of that node. If equal - search is finished, otherwise the element is either in left or right subtrees, if at all.
Thus, assuming the tree is "balanced", at each node the search space is approximately halved, and so search would have asymptotic complexity of $O(\log{n})$.

#+name: sets-interface-binary-tree-1
#+begin_src racket :exports code
  (define (make-tree entry left right)
    (list entry left right))

  (define (entry tree) (car tree))
  (define (left-branch tree) (cadr tree))
  (define (right-branch tree) (caddr tree))

  (define (element-of-set? x set)
    (cond ((null? set) false)
	  ((= x (entry set)) true)
	  ((< x (entry set)) (element-of-set? x (left-branch set)))
	  ((> x (entry set)) (element-of-set? x (right-branch set)))))

  (define (adjoint-set x set)
    (cond ((null? set) (make-tree x '() '()))
	  ((= x (entry set)) set)
	  ((< x (entry set))
	   (make-tree x
		      (adjoint-set x (left-branch set))
		      (right-branch set)))
	  ((> x (entry set))
	   (make-tree x
		      (left-branch set)
		      (adjoint-set x (right-branch set))))))
#+end_src

"Balanced" assumption is important for search and insert to maintain $O(\log{n})$ complexity, and there ways to design data structres in a way to maintan balance, they are not discussed here.

**** Exercise 2.63 - ~tree->list~

#+name: tree->list
#+begin_src racket :exports code
  (define (tree->list-1 tree)
    (if (null? tree)
	'()
	(append (tree->list-1 (left-branch tree))
		(cons (entry tree)
		      (tree->list-1 (right-branch tree))))))

  (define (tree->list-2 tree)
    (define (copy-to-list tree result-list)
      (if (null? tree)
	  result-list
	  (copy-to-list (left-branch tree)
			(cons (entry tree)
			      (copy-to-list (right-branch tree)
					    result-list)))))
    (copy-to-list tree '()))
#+end_src

Both procedures produce the same result for every tree - an ordered list of elements from smaller to larger.

For each of the tree they both produce ~(1 3 5 7 9 11)~ as output.

Assuming the tree is balanced, let's calculate the orders of growth:

For ~tree->list-1~:

Let $T(n)$ be the number of steps it takes for ~tree->list-1~ to convert a tree into a list.
~tree->list-1~ calls itself twice with halved tree + it calls ~append~ which grows as $O(n)$:

$$ T(n) = 2*T(n/2)+O(n/2) $$

expanding a few levels into the tree

$$ T(n) = 2*(2*(2*T(n/8)+O(n/8))+O(n/4))+O(n/2) = ... \text{nested} \log{n}\,\text{times} ... = 2^{\log{n}}*T(1) + \log{n}*O(n/2), $$

it can easily be shown that $$ T(1) = c $$

therefore  $$ T(n) = nc+\log{n}O(n/2) $$ and ~tree->list-1~ number of steps grows as $O(n\log{n})$

For ~tree->list-1~:
Let $T(n)$ be the number of steps it takes for ~tree->list-2~ to convert a tree into a list.
~tree->list-2~ calls itself twice with halved tree + ~cons~ which grows as $O(1)$:

$$ T(n) = 2*T(n/2) + O(1) $$

expanding a few levels into the tree

$$ T(n) = 2*(2*(2*T(n/8) + O(1)) + O(1)) + O(1) = ... = 2^{\log{n}}*T(1) + \log{n}*O(1) $$

as $$ T(1) = c $$

$$ T(n) = nc + \log{n} $$

and therefore ~tree->list-2~ has the order of growth of $O(n)$.

Thus, the number of steps to compute ~tree->list-2~ grows slower than the number of steps to compute ~tree->list-1~ with the number of elements in a balanced tree.

**** Exercise 2.64 - ~list->tree~

~list->tree~ converts a list of ordered elements to a balanced binary tree.

#+name: list->tree
#+begin_src racket :exports code
  (define (list->tree elements)
    (car (partial-tree elements (length elements))))

  (define (partial-tree elts n)
    (if (= n 0)
	(cons '() elts)
	(let ((left-size (quotient (- n 1) 2)))
	  (let ((left-result (partial-tree elts left-size)))
	    (let ((left-tree (car left-result))
		  (non-left-elts (cdr left-result))
		  (right-size (- n (+ left-size 1))))
	      (let ((this-entry (car non-left-elts))
		    (right-result (partial-tree (cdr non-left-elts) right-size)))
		(let ((right-tree (car right-result))
		      (remaining-elts (cdr right-result)))
		  (cons (make-tree this-entry left-tree right-tree)
			remaining-elts))))))))
#+end_src

~partial-tree~ splits the first ~n~ items of ~elts~ into 3 parts - left (of size $(n-1)/2)$, "this" (1 element) and right ($n-left-1$ elements). Then it comptes ~partial-tree~ for left, right, and constructs a tree with "this" as an entry and newly constructed left and right subtrees.

Result of the execution for input ~(1 3 5 7 9 11)~ is the tree:
#+begin_export ascii
          5
	 / \
        /   \
       1     9
	\   / \
         3 7   11
#+end_export

Let $T(n)$ be the number of steps it takes to convert $n$ element list for ~partial-tree~.

~partial-tree~ calls itself with approximately halved input twice, for left and right trees.

$$ T(n) = 2*T(n/2) = 2*2*T(n/4) = ... = 2^{\log{n}} * T(1) = n * T(1) $$

and in can be shown that $$ T(1) = c $$ for some constant $c$

Thus, $$ T(n) = nc $$ and therefore ~partial-tree~ has the order of growth of the number of steps of $O(n)$.

