s2.3-symbolic-data.html

<div id="outline-container-orgcf1605e" class="outline-3">
<h3 id="orgcf1605e">Sets as binary trees</h3>
<div class="outline-text-3" id="text-orgcf1605e">
<p>
Each node of the tree holds one element of the set, the "entry" of that node, and links to other two nodes, possibly empty.
The "left" node's entry is smaller than the node's "entry", and the "right" node's entry is larger.
</p>

<p>
Because every node has left and right, each represents a tree with two subtrees, with left subree holding elements smaller than node's entry, and right holding elements larger thant node's entry.
</p>

<p>
Benefit of the tree structure is that when searching a tree for the element <code>, at each node ~x</code> is either equal, smaller or greater than the entry of that node. If equal - search is finished, otherwise the element is either in left or right subtrees, if at all.
Thus, assuming the tree is "balanced", at each node the search space is approximately halved, and so search would have asymptotic complexity of \(O(\log{n})\).
</p>

<div class="org-src-container">
<pre class="src src-racket" id="org1c8a19b">(define (make-tree entry left right)
  (list entry left right))

(define (entry tree) (car tree))
(define (left-branch tree) (cadr tree))
(define (right-branch tree) (caddr tree))

(define (element-of-set? x set)
  (cond ((null? set) false)
	((= x (entry set)) true)
	((&lt; x (entry set)) (element-of-set? x (left-branch set)))
	((&gt; x (entry set)) (element-of-set? x (right-branch set)))))

(define (adjoint-set x set)
  (cond ((null? set) (make-tree x '() '()))
	((= x (entry set)) set)
	((&lt; x (entry set))
	 (make-tree x
		    (adjoint-set x (left-branch set))
		    (right-branch set)))
	((&gt; x (entry set))
	 (make-tree x
		    (left-branch set)
		    (adjoint-set x (right-branch set))))))
</pre>
</div>

<p>
"Balanced" assumption is important for search and insert to maintain \(O(\log{n})\) complexity, and there ways to design data structres in a way to maintan balance, they are not discussed here.
</p>
</div>

<div id="outline-container-org78fdc27" class="outline-4">
<h4 id="org78fdc27">Exercise 2.63 - <code>tree-&gt;list</code></h4>
<div class="outline-text-4" id="text-org78fdc27">
<div class="org-src-container">
<pre class="src src-racket" id="org9920619">(define (tree-&gt;list-1 tree)
  (if (null? tree)
      '()
      (append (tree-&gt;list-1 (left-branch tree))
	      (cons (entry tree)
		    (tree-&gt;list-1 (right-branch tree))))))

(define (tree-&gt;list-2 tree)
  (define (copy-to-list tree result-list)
    (if (null? tree)
	result-list
	(copy-to-list (left-branch tree)
		      (cons (entry tree)
			    (copy-to-list (right-branch tree)
					  result-list)))))
  (copy-to-list tree '()))
</pre>
</div>

<p>
Both procedures produce the same result for every tree - an ordered list of elements from smaller to larger.
</p>

<p>
For each of the tree they both produce <code>(1 3 5 7 9 11)</code> as output.
</p>

<p>
Assuming the tree is balanced, let's calculate the orders of growth:
</p>

<p>
For <code>tree-&gt;list-1</code>:
</p>

<p>
Let \(T(n)\) be the number of steps it takes for <code>tree-&gt;list-1</code> to convert a tree into a list.
<code>tree-&gt;list-1</code> calls itself twice with halved tree + it calls <code>append</code> which grows as \(O(n)\):
</p>

<p>
\[ T(n) = 2*T(n/2)+O(n/2) \]
</p>

<p>
expanding a few levels into the tree
</p>

<p>
\[ T(n) = 2*(2*(2*T(n/8)+O(n/8))+O(n/4))+O(n/2) = ... \text{nested} \log{n}\,\text{times} ... = 2^{\log{n}}*T(1) + \log{n}*O(n/2), \]
</p>

<p>
it can easily be shown that \[ T(1) = c \]
</p>

<p>
therefore  \[ T(n) = nc+\log{n}O(n/2) \] and <code>tree-&gt;list-1</code> number of steps grows as \(O(n\log{n})\)
</p>

<p>
For <code>tree-&gt;list-1</code>:
Let \(T(n)\) be the number of steps it takes for <code>tree-&gt;list-2</code> to convert a tree into a list.
<code>tree-&gt;list-2</code> calls itself twice with halved tree + <code>cons</code> which grows as \(O(1)\):
</p>

<p>
\[ T(n) = 2*T(n/2) + O(1) \]
</p>

<p>
expanding a few levels into the tree
</p>

<p>
\[ T(n) = 2*(2*(2*T(n/8) + O(1)) + O(1)) + O(1) = ... = 2^{\log{n}}*T(1) + \log{n}*O(1) \]
</p>

<p>
as \[ T(1) = c \]
</p>

<p>
\[ T(n) = nc + \log{n} \]
</p>

<p>
and therefore <code>tree-&gt;list-2</code> has the order of growth of \(O(n)\).
</p>

<p>
Thus, the number of steps to compute <code>tree-&gt;list-2</code> grows slower than the number of steps to compute <code>tree-&gt;list-1</code> with the number of elements in a balanced tree.
</p>
</div>
</div>

<div id="outline-container-orgf9d02e5" class="outline-4">
<h4 id="orgf9d02e5">Exercise 2.64 - <code>list-&gt;tree</code></h4>
<div class="outline-text-4" id="text-orgf9d02e5">
<p>
<code>list-&gt;tree</code> converts a list of ordered elements to a balanced binary tree.
</p>

<div class="org-src-container">
<pre class="src src-racket" id="orge4bc291">(define (list-&gt;tree elements)
  (car (partial-tree elements (length elements))))

(define (partial-tree elts n)
  (if (= n 0)
      (cons '() elts)
      (let ((left-size (quotient (- n 1) 2)))
	(let ((left-result (partial-tree elts left-size)))
	  (let ((left-tree (car left-result))
		(non-left-elts (cdr left-result))
		(right-size (- n (+ left-size 1))))
	    (let ((this-entry (car non-left-elts))
		  (right-result (partial-tree (cdr non-left-elts) right-size)))
	      (let ((right-tree (car right-result))
		    (remaining-elts (cdr right-result)))
		(cons (make-tree this-entry left-tree right-tree)
		      remaining-elts))))))))
</pre>
</div>

<p>
<code>partial-tree</code> splits the first <code>n</code> items of <code>elts</code> into 3 parts - left (of size \((n-1)/2)\), "this" (1 element) and right (\(n-left-1\) elements). Then it comptes <code>partial-tree</code> for left, right, and constructs a tree with "this" as an entry and newly constructed left and right subtrees.
</p>

<p>
Result of the execution for input <code>(1 3 5 7 9 11)</code> is the tree:
</p>
<p>
Let \(T(n)\) be the number of steps it takes to convert \(n\) element list for <code>partial-tree</code>.
</p>

<p>
<code>partial-tree</code> calls itself with approximately halved input twice, for left and right trees.
</p>

<p>
\[ T(n) = 2*T(n/2) = 2*2*T(n/4) = ... = 2^{\log{n}} * T(1) = n * T(1) \]
</p>

<p>
and in can be shown that \[ T(1) = c \] for some constant \(c\)
</p>

<p>
Thus, \[ T(n) = nc \] and therefore <code>partial-tree</code> has the order of growth of the number of steps of \(O(n)\).
</p>
</div>
</div>
