s2.3-symbolic-data.org
**** Exercise 2.65 - ~union-set~ and ~intersection-set~

#+name: sets-interface-binary-tree-2
#+begin_src racket :exports code :noweb strip-export
  <<tree->list>>
  <<list->tree>>
  (define (union-set set1 set2)
    (define (merge xs ys)
      (cond ((null? xs) ys)
	    ((null? ys) xs)
	    (else
	     (let ((x (car xs))
		   (y (car ys)))
	       (cond ((= x y)
		      (cons x (merge (cdr xs) (cdr ys))))
		     ((< x y)
		      (cons x (merge (cdr xs) ys)))
		     ((> x y)
		      (cons y (merge xs (cdr ys)))))))))
    (let ((xs (tree->list-2 set1))
	  (ys (tree->list-2 set2)))
      (list->tree (merge xs ys))))


  (define (intersection-set set1 set2)
    (define (common xs ys)
      (cond ((or (null? xs) (null? ys))
	     '())
	    (else
	     (let ((x (car xs))
		   (y (car ys)))
	       (cond ((= x y)
		      (cons x (common (cdr xs) (cdr ys))))
		     ((< x y)
		      (common (cdr xs) ys))
		     ((> x y)
		      (common xs (cdr ys))))))))
    (let ((xs (tree->list-2 set1))
	  (ys (tree->list-2 set2)))
      (list->tree (common xs ys))))
#+end_src

#+begin_src racket
  #lang sicp
  <<sets-interface-binary-tree-1>>
  <<sets-interface-binary-tree-2>>


  (union-set (make-tree 5
			(make-tree 3 '() '())
			(make-tree 7
				   (make-tree 6 '() '())
				   '()))
	     (make-tree 5
			(make-tree 3 '() '())
			(make-tree 9
				   '()
				   (make-tree 11 '() '()))))

  (intersection-set (make-tree 5
			       (make-tree 3 '() '())
			       (make-tree 7
					  (make-tree 6 '() '())
					  '()))
		    (make-tree 5
			       (make-tree 3 '() '())
			       (make-tree 9
					  '()
					  (make-tree 11 '() '()))))

  (define t make-tree)
  (define o '())
  
  (intersection-set (t 5
		       (t 3 o o)
		       (t 7
			  (t 6 o o)
			  o))
		    (t 10
		       o
		       (t 11
			  o
			  (t 12
			     o
			     o))))

#+end_src

#+RESULTS[04602d53f381b73c0ca25e7715130dfefae7e83c]:
: (6 (3 () (5 () ())) (9 (7 () ()) (11 () ())))
: (3 () (5 () ()))
: ()

*** Sets and information retrieval

Given a set of records, we need a way to retrieve any individual record often and fast. For that, each record can be identified with a unique key.

If the set of records is represented as an unordered list:

#+begin_src racket
  (define (lookup given-key set-of-records)
    (cond ((null? set-of-records) false)
	  ((equal? given-key (key (car set-of-records)))
	   (car set-of-records))
	  (else
	   (lookup given-key (cdr set-of-records)))))
#+end_src

**** Exercise 2.66 - ~lookup~ for the set representation based on binary tree

#+begin_src racket
  (define (lookup given-key node)
    (cond ((null? node)
	   false)
	  ((= given-key (key (entry node)))
	   (entry node))
	  ((< given-key (key (entry node)))
	   (lookup given-key (left node)))
	  ((> given-key (key (entry node)))
	   (lookup given-key (right node)))))

  (define (node key record left right)
    (list key record left right))

  (define (entry node)
    (cons (car node) (cadr node)))

  (define (key entry)
    (car entry))

  (define (left node)
    (caddr node))

  (define (right node)
    (cadddr node))

  (lookup 9 (node 5
		  (list 'bob 23)
		  (node 3
			(list 'alice 22)
			'()
			'())
		  (node 7
			(list 'camille 28)
			'()
			(node 9
			      (list 'david 25)
			      '()
			      '()))))
#+end_src

#+RESULTS[2e3907ce34244b429e932acfdd82bd81e065acd8]:
: '(9 david 25)

** 2.3.4 Example: Huffman Encoding Trees

p.161-162 have description of fixed-length vs variable-length binary encoding.

A problem with variable-length encoding is knowing when the end of a symbol is reached. Morse code solves it by the separator code (pause). Another way to solve it is to not let any letter code be an exact prefix of any other letter code.

Huffman encoding is a way to implement variable-length binary encoding.

A Huffman code can be represented as a tree where each leaf represents a letter to be encoded, and each non-leaf node stores a set of letters under that node. In addition, each letter at a leaf is assigned a weight (which is a relative frequency), and each non-leaf node stores the sum of all weights in leafs under that node.

Given a Huffman tree, we can find an encoding of any letter by descending down the tree until the leaf with that letter is reached, appending 0 each time left subtree is selected and 1 each time right subtree is selected. Subtree is selected using the set of letters under the subtree.

To decode a binary sequence, start at the root and for 0 go left, for 1 go down, when reaching a leaf write down that symbol, and start over again at the root.


*** Generating Huffman trees

The idea is to arrange tree such that the symbols with the lowest frequencies appear further away from the root.

Start with the set of leaf nodes, find two nodes with the smallest weights, merge them to form a new node with the two nodes as the subtrees and weight of the sum of the two nodes weights, and replace the two nodes with the new set. Repeat until the set contains a signle node, which is the Huffman tree for the given frequencies.

*** Representing Huffman trees

#+name: huffman-tree-interface
#+begin_src racket :exports code
  (define (make-leaf symbol weight)
    (list 'leaf symbol weight))

  (define (leaf? object)
    (eq? (car object) 'leaf))

  (define (symbol-leaf x) (cadr x))
  (define (weight-leaf x) (caddr x))

  (define (make-code-tree left right)
    (list left
	  right
	  (append (symbols left) (symbols right))
	  (+ (weight left) (weight right))))

  (define (left-branch tree) (car tree))
  (define (right-branch tree) (cadr tree))
  (define (symbols tree)
    (if (leaf? tree)
	(list (symbol-leaf tree))
	(caddr tree)))
  (define (weight tree)
    (if (leaf? tree)
	(weight-leaf tree)
	(cadddr tree)))
#+end_src

~symbols~ and ~weight~ are examples of /generic procedures/ - those can handle more than one type of data.

*** The decoding procedure

#+name: huffman-tree-decode
#+begin_src racket :exports code
  (define (decode bits tree)
    (define (decode-1 bits current-branch)
      (if (null? bits)
	  '()
	  (let ((next-branch (choose-branch (car bits) current-branch)))
	    (if (leaf? next-branch)
		(cons (symbol-leaf next-branch)
		      (decode-1 (cdr bits) tree))
		(decode-1 (cdr bits) next-branch)))))
    (decode-1 bits tree))

  (define (choose-branch bit tree)
    (cond ((= 0 bit)
	   (left-branch tree))
	  ((= 1 bit)
	   (right-branch tree))
	  (else
	   (error "bad bit -- CHOOSE-BRANCH" bit))))
#+end_src

*** Set of weighted-elements

#+name: huffman-tree-leaf-set
#+begin_src racket :exports code
  (define (adjoint-set x set)
    (cond ((null? set) (list x))
	  ((< (weight x) (weight (car set)))
	   (cons x set))
	  (else
	   (cons (car set) (adjoint-set x (cdr set))))))

  (define (make-leaf-set pairs)
    (if (null? pairs)
	'()
	(let ((pair (car pairs)))
	  (adjoint-set (make-leaf (car pair) (cadr pair))
		       (make-leaf-set (cdr pairs))))))
#+end_src

