s2.3-symbolic-data.html

<div id="outline-container-org40293f2" class="outline-4">
<h4 id="org40293f2">Exercise 2.65 - <code>union-set</code> and <code>intersection-set</code></h4>
<div class="outline-text-4" id="text-org40293f2">
<div class="org-src-container">
<pre class="src src-racket" id="org4bd6769">

(define (union-set set1 set2)
  (define (merge xs ys)
    (cond ((null? xs) ys)
	  ((null? ys) xs)
	  (else
	   (let ((x (car xs))
		 (y (car ys)))
	     (cond ((= x y)
		    (cons x (merge (cdr xs) (cdr ys))))
		   ((&lt; x y)
		    (cons x (merge (cdr xs) ys)))
		   ((&gt; x y)
		    (cons y (merge xs (cdr ys)))))))))
  (let ((xs (tree-&gt;list-2 set1))
	(ys (tree-&gt;list-2 set2)))
    (list-&gt;tree (merge xs ys))))


(define (intersection-set set1 set2)
  (define (common xs ys)
    (cond ((or (null? xs) (null? ys))
	   '())
	  (else
	   (let ((x (car xs))
		 (y (car ys)))
	     (cond ((= x y)
		    (cons x (common (cdr xs) (cdr ys))))
		   ((&lt; x y)
		    (common (cdr xs) ys))
		   ((&gt; x y)
		    (common xs (cdr ys))))))))
  (let ((xs (tree-&gt;list-2 set1))
	(ys (tree-&gt;list-2 set2)))
    (list-&gt;tree (common xs ys))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-racket">#lang sicp




(union-set (make-tree 5
		      (make-tree 3 '() '())
		      (make-tree 7
				 (make-tree 6 '() '())
				 '()))
	   (make-tree 5
		      (make-tree 3 '() '())
		      (make-tree 9
				 '()
				 (make-tree 11 '() '()))))

(intersection-set (make-tree 5
			     (make-tree 3 '() '())
			     (make-tree 7
					(make-tree 6 '() '())
					'()))
		  (make-tree 5
			     (make-tree 3 '() '())
			     (make-tree 9
					'()
					(make-tree 11 '() '()))))

(define t make-tree)
(define o '())

(intersection-set (t 5
		     (t 3 o o)
		     (t 7
			(t 6 o o)
			o))
		  (t 10
		     o
		     (t 11
			o
			(t 12
			   o
			   o))))

</pre>
</div>

<pre class="example">
(6 (3 () (5 () ())) (9 (7 () ()) (11 () ())))
(3 () (5 () ()))
()
</pre>
</div>
</div>
</div>

<div id="outline-container-org0883d60" class="outline-3">
<h3 id="org0883d60">Sets and information retrieval</h3>
<div class="outline-text-3" id="text-org0883d60">
<p>
Given a set of records, we need a way to retrieve any individual record often and fast. For that, each record can be identified with a unique key.
</p>

<p>
If the set of records is represented as an unordered list:
</p>

<div class="org-src-container">
<pre class="src src-racket">(define (lookup given-key set-of-records)
  (cond ((null? set-of-records) false)
	((equal? given-key (key (car set-of-records)))
	 (car set-of-records))
	(else
	 (lookup given-key (cdr set-of-records)))))
</pre>
</div>

<pre class="example">
/var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-zZRoPb/ob-racketddHvZb.rkt:5:28: key: unbound identifier
  in: key
  location...:
   /var/folders/9t/w6bf6xgd4qs98pm22l9hcpk40000gn/T/ob-racket-zZRoPb/ob-racketddHvZb.rkt:5:28
</pre>
</div>

<div id="outline-container-org9ba1034" class="outline-4">
<h4 id="org9ba1034">Exercise 2.66 - <code>lookup</code> for the set representation based on binary tree</h4>
<div class="outline-text-4" id="text-org9ba1034">
<div class="org-src-container">
<pre class="src src-racket">(define (lookup given-key node)
  (cond ((null? node)
	 false)
	((= given-key (key (entry node)))
	 (entry node))
	((&lt; given-key (key (entry node)))
	 (lookup given-key (left node)))
	((&gt; given-key (key (entry node)))
	 (lookup given-key (right node)))))

(define (node key record left right)
  (list key record left right))

(define (entry node)
  (cons (car node) (cadr node)))

(define (key entry)
  (car entry))

(define (left node)
  (caddr node))

(define (right node)
  (cadddr node))

(lookup 9 (node 5
		(list 'bob 23)
		(node 3
		      (list 'alice 22)
		      '()
		      '())
		(node 7
		      (list 'camille 28)
		      '()
		      (node 9
			    (list 'david 25)
			    '()
			    '()))))
</pre>
</div>

<pre class="example">
'(9 david 25)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4b57b34" class="outline-2">
<h2 id="org4b57b34">2.3.4 Example: Huffman Encoding Trees</h2>
<div class="outline-text-2" id="text-org4b57b34">
<p>
p.161-162 have description of fixed-length vs variable-length binary encoding.
</p>

<p>
A problem with variable-length encoding is knowing when the end of a symbol is reached. Morse code solves it by the separator code (pause). Another way to solve it is to not let any letter code be an exact prefix of any other letter code.
</p>

<p>
Huffman encoding is a way to implement variable-length binary encoding.
</p>

<p>
A Huffman code can be represented as a tree where each leaf represents a letter to be encoded, and each non-leaf node stores a set of letters under that node. In addition, each letter at a leaf is assigned a weight (which is a relative frequency), and each non-leaf node stores the sum of all weights in leafs under that node.
</p>

<p>
Given a Huffman tree, we can find an encoding of any letter by descending down the tree until the leaf with that letter is reached, appending 0 each time left subtree is selected and 1 each time right subtree is selected. Subtree is selected using the set of letters under the subtree.
</p>

<p>
To decode a binary sequence, start at the root and for 0 go left, for 1 go down, when reaching a leaf write down that symbol, and start over again at the root.
</p>
</div>


<div id="outline-container-org97db93a" class="outline-3">
<h3 id="org97db93a">Generating Huffman trees</h3>
<div class="outline-text-3" id="text-org97db93a">
<p>
The idea is to arrange tree such that the symbols with the lowest frequencies appear further away from the root.
</p>

<p>
Start with the set of leaf nodes, find two nodes with the smallest weights, merge them to form a new node with the two nodes as the subtrees and weight of the sum of the two nodes weights, and replace the two nodes with the new set. Repeat until the set contains a signle node, which is the Huffman tree for the given frequencies.
</p>
</div>
</div>

<div id="outline-container-org7368eab" class="outline-3">
<h3 id="org7368eab">Representing Huffman trees</h3>
<div class="outline-text-3" id="text-org7368eab">
<div class="org-src-container">
<pre class="src src-racket" id="orgf110023">(define (make-leaf symbol weight)
  (list 'leaf symbol weight))

(define (leaf? object)
  (eq? (car object) 'leaf))

(define (symbol-leaf x) (cadr x))
(define (weight-leaf x) (caddr x))

(define (make-code-tree left right)
  (list left
	right
	(append (symbols left) (symbols right))
	(+ (weight left) (weight right))))

(define (left-branch tree) (car tree))
(define (right-branch tree) (cadr tree))
(define (symbols tree)
  (if (leaf? tree)
      (list (symbol-leaf tree))
      (caddr tree)))
(define (weight tree)
  (if (leaf? tree)
      (weight-leaf tree)
      (cadddr tree)))
</pre>
</div>

<p>
<code>symbols</code> and <code>weight</code> are examples of <i>generic procedures</i> - those can handle more than one type of data.
</p>
</div>
</div>

<div id="outline-container-orgb66e8ab" class="outline-3">
<h3 id="orgb66e8ab">The decoding procedure</h3>
<div class="outline-text-3" id="text-orgb66e8ab">
<div class="org-src-container">
<pre class="src src-racket" id="org5951d9a">(define (decode bits tree)
  (define (decode-1 bits current-branch)
    (if (null? bits)
	'()
	(let ((next-branch (choose-branch (car bits) current-branch)))
	  (if (leaf? next-branch)
	      (cons (symbol-leaf next-branch)
		    (decode-1 (cdr bits) tree))
	      (decode-1 (cdr bits) next-branch)))))
  (decode-1 bits tree))

(define (choose-branch bit tree)
  (cond ((= 0 bit)
	 (left-branch tree))
	((= 1 bit)
	 (right-branch tree))
	(else
	 (error "bad bit -- CHOOSE-BRANCH" bit))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orge87ae28" class="outline-3">
<h3 id="orge87ae28">Set of weighted-elements</h3>
<div class="outline-text-3" id="text-orge87ae28">
<div class="org-src-container">
<pre class="src src-racket" id="orgddebb6b">(define (adjoint-set x set)
  (cond ((null? set) (list x))
	((&lt; (weight x) (weight (car set)))
	 (cons x set))
	(else
	 (cons (car set) (adjoint-set x (cdr set))))))

(define (make-leaf-set pairs)
  (if (null? pairs)
      '()
      (let ((pair (car pairs)))
	(adjoint-set (make-leaf (car pair) (cadr pair))
		     (make-leaf-set (cdr pairs))))))
</pre>
</div>
</div>
</div>
