s2.3-symbolic-data.org
*** Exercise 2.67 - run ~decode~

#+begin_src racket
  #lang sicp

  <<huffman-tree-interface>>
  <<huffman-tree-decode>>

  (define sample-tree
    (make-code-tree (make-leaf 'A 4)
		    (make-code-tree
		     (make-leaf 'B 2)
		     (make-code-tree
		      (make-leaf 'D 1)
		      (make-leaf 'C 1)))))

  (define sample-message '(0 1 1 0 0 1 0 1 0 1 1 1 0))

  (decode sample-message sample-tree)
#+end_src

#+RESULTS[abf24b7f981779bae20fe42169bfcdee31dc72c9]:
: (A D A B B C A)

*** Exercise 2.68 - ~encode~

#+name: huffman-tree-encode
#+begin_src racket :exports code
  (define (encode message tree)
    (if (null? message)
	'()
	(append (encode-symbol (car message) tree)
		(encode (cdr message) tree))))

  (define (encode-symbol symbol tree)
    (cond ((leaf? tree) '())
	  ((contains? (symbols (left-branch tree)) symbol)
	   (cons 0 (encode-symbol symbol (left-branch tree))))
	  ((contains? (symbols (right-branch tree)) symbol)
	   (cons 1 (encode-symbol symbol (right-branch tree))))
	  (else
	   (error "symbol has no encoding -- ENCODE-SYMBOL" symbol))))

  (define (contains? haystack needle)
    (cond ((null? haystack) false)
	  ((eq? (car haystack) needle) true)
	  (else (contains? (cdr haystack) needle))))
#+end_src

#+begin_src racket
  <<huffman-tree-interface>>
  <<huffman-tree-encode>>

  (define sample-tree
    (make-code-tree (make-leaf 'A 4)
		    (make-code-tree
		     (make-leaf 'B 2)
		     (make-code-tree
		      (make-leaf 'D 1)
		      (make-leaf 'C 1)))))

  (define sample-message '(A D A B B C A))

  (encode sample-message sample-tree)
 #+end_src

#+RESULTS[5cbecb9f856f6f3e47c9d2a696f2ccda780e09af]:
: '(0 1 1 0 0 1 0 1 0 1 1 1 0)

*** Exercise 2.69 - ~generate-huffman-tree~

#+name: huffman-tree-generate
#+begin_src racket :exports code
  (define (generate-huffman-tree pairs)
    (successive-merge (make-leaf-set pairs)))

  (define (successive-merge node-set)
    (cond ((null? node-set)
	   (error "Empty node-set -- SUCCESSIVE-MERGE"))
	  ((null? (cdr node-set))
	   (car node-set))
	  (else
	   (successive-merge
	    (adjoint-set (make-code-tree
			  (car node-set)
			  (cadr node-set))
			 (cddr node-set))))))
#+end_src

*** Exercise 2.70 - check it out

Here's the full listing of the code developed so far:
#+name: huffman-tree-full
#+begin_src racket -n 1 :exports code :noweb yes :tangle "s2.3.3-huffman-encoding-trees.rkt"
  #lang sicp

  <<huffman-tree-interface>>

  <<huffman-tree-leaf-set>>

  <<huffman-tree-generate>>

  <<huffman-tree-encode>>

  <<huffman-tree-decode>>
#+end_src

#+RESULTS[2c8341f37b55dce7019649ddad9c8f803b3a1f0f]: huffman-tree-full

#+begin_src racket
  <<huffman-tree-full>>
  (define rock-frequencies '((A 2)
			     (BOOM 1)
			     (GET 2)
			     (JOB 2)
			     (NA 16)
			     (SHA 3)
			     (YIP 9)
			     (WAH 1)))

  (define rock-tree (generate-huffman-tree rock-frequencies))

  (define rock-song '(GET A JOB
			  SHA NA NA NA NA NA NA NA NA
			  GET A JOB
			  SHA NA NA NA NA NA NA NA NA
			  WAH YIP YIP YIP YIP YIP YIP YIP YIP YIP
			  SHA BOOM))

  (define enc (encode rock-song rock-tree))
  (define dec (decode enc rock-tree))

  enc
  (display (list (length enc) "bits required to encode original message using a variable-length encoding method")) (newline)
  dec
  (display (list (* 3 (length dec))
		 "bits would be used by the the fixed-length for 8=2^3 characters alphabet")) (newline)
#+end_src

#+RESULTS[ddc4218c8ee808da10eae23bc5cba41e8072f866]:
: '(1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 1 1 0 1 1 0 1 1)
: (84 bits required to encode original message using a variable-length encoding method)
: '(GET A JOB SHA NA NA NA NA NA NA NA NA GET A JOB SHA NA NA NA NA NA NA NA NA WAH YIP YIP YIP YIP YIP YIP YIP YIP YIP SHA BOOM)
: (108 bits would be used by the the fixed-length for 8=2^3 characters alphabet)

