s2.3-symbolic-data.org
*** Exercise 2.71 - frequencies in geometric progression

Suppose we have a Huffman tree for an alphabet of $n$ symbols, with relative frequences $1, 2, 4, ..., 2^{n-1}$.
Example of tree for $n = 5$
#+begin_src
    .
   / \
  a   .
     / \
    b   .
       / \
      c   .
	 / \
	d   e
#+end_src

Example of tree for $n = 10$
#+begin_src
    .
   / \
  a   .
     / \
    b   .
       / \
      c   .
	 / \
	d   .
	   / \
	  e   .
	     / \
	    f   .
	       / \
	      g   .
		 / \
		h   .
		   / \
                  i   j
#+end_src

Key observation with this special case is that during the tree generation, newly merged node's weight is always less than the least-weight node weight in the remaining set ($2^{k+1} - 1 < 2^{k+1}$).
Then, on every merge except the very first one, the first node is a leaf node and the second is a tree with all less frequent symbols than the first node's symbol.

The leaf with the least frequent symbol will be carried over in the same growing tree until construction is done, that is for $n-1$ steps, and thus will have a distance of $n-1$ from the root.

The most frequent symbol will be merged last, and so will be at a distance of $1$ from the root.

*** Exercise 2.72 - order of growth of ~encode~

Here is the code again:
#+begin_src racket :exports code
  (define (encode message tree)
    (if (null? message)
	'()
	(append (encode-symbol (car message) tree)
		(encode (cdr message) tree))))

  (define (encode-symbol symbol tree)
    (cond ((leaf? tree) '())
	  ((contains? (symbols (left-branch tree)) symbol)
	   (cons 0 (encode-symbol symbol (left-branch tree))))
	  ((contains? (symbols (right-branch tree)) symbol)
	   (cons 1 (encode-symbol symbol (right-branch tree))))
	  (else
	   (error "symbol has no encoding -- ENCODE-SYMBOL" symbol))))

  (define (contains? haystack needle)
    (cond ((null? haystack) false)
	  ((eq? (car haystack) needle) true)
	  (else (contains? (cdr haystack) needle))))

#+end_src

Assume we have a Huffman tree of an alphabet with $n$ symbols with relative frequencies $1, 2, 4, ..., 2^{n-1}$.
Assume the message has the size $m$ and has the same frequencies distribution as the alphabet that generated the tree.

Note that the distance of each leaf from the root is $n-1, n-1, n-2, n-3, ..., 3, 2, 1$.

~encode~ calls ~encode-symbol~ for each symbol of the message, that's $m$ calls.

Around half of those calls would be for the most frequent symbol, a quarter for the second most frequent symbol and so on.
The expected depth $d_a$ of each call then will be:

$$ d_a = \frac{1}{2} * 1 + \frac{1}{4} * 2 + \frac{1}{8} * 3 + ... + \frac{1}{2^{n-1}} * (n-1) + \frac{1}{2^n} * n = ... = 2 - (n+2)/2^n $$

If $n$ is large enough, $d_a \approx 2$, e.g. $d_a \approx 1.99$ for $n=10$.

Thus, on average a call to ~encode-symbol~ takes 2 iterations, for simplicity say each can take up to $n$ steps to search symbols of that node, $2n$ in total, that's $O(n)$.

Thus, on average ~encode~ runs in $O(mn)$ steps.
