s2.3-symbolic-data.html

<div id="outline-container-org0a854bb" class="outline-3">
<h3 id="org0a854bb">Exercise 2.71 - frequencies in geometric progression</h3>
<div class="outline-text-3" id="text-org0a854bb">
<p>
Suppose we have a Huffman tree for an alphabet of \(n\) symbols, with relative frequences \(1, 2, 4, ..., 2^{n-1}\).
Example of tree for \(n = 5\)
</p>
<pre class="example">
  .
 / \
a   .
   / \
  b   .
     / \
    c   .
       / \
      d   e
</pre>

<p>
Example of tree for \(n = 10\)
</p>
<pre class="example">
  .
 / \
a   .
   / \
  b   .
     / \
    c   .
       / \
      d   .
	 / \
	e   .
	   / \
	  f   .
	     / \
	    g   .
	       / \
	      h   .
		 / \
		i   j
</pre>

<p>
Key observation with this special case is that during the tree generation, newly merged node's weight is always less than the least-weight node weight in the remaining set (\(2^{k+1} - 1 < 2^{k+1}\)).
Then, on every merge except the very first one, the first node is a leaf node and the second is a tree with all less frequent symbols than the first node's symbol.
</p>

<p>
The leaf with the least frequent symbol will be carried over in the same growing tree until construction is done, that is for \(n-1\) steps, and thus will have a distance of \(n-1\) from the root.
</p>

<p>
The most frequent symbol will be merged last, and so will be at a distance of \(1\) from the root.
</p>
</div>
</div>

<div id="outline-container-org4be9911" class="outline-3">
<h3 id="org4be9911">Exercise 2.72 - order of growth of <code>encode</code></h3>
<div class="outline-text-3" id="text-org4be9911">
<p>
Here is the code again:
</p>
<div class="org-src-container">
<pre class="src src-racket">(define (encode message tree)
  (if (null? message)
      '()
      (append (encode-symbol (car message) tree)
	      (encode (cdr message) tree))))

(define (encode-symbol symbol tree)
  (cond ((leaf? tree) '())
	((contains? (symbols (left-branch tree)) symbol)
	 (cons 0 (encode-symbol symbol (left-branch tree))))
	((contains? (symbols (right-branch tree)) symbol)
	 (cons 1 (encode-symbol symbol (right-branch tree))))
	(else
	 (error "symbol has no encoding -- ENCODE-SYMBOL" symbol))))

(define (contains? haystack needle)
  (cond ((null? haystack) false)
	((eq? (car haystack) needle) true)
	(else (contains? (cdr haystack) needle))))

</pre>
</div>

<p>
Assume we have a Huffman tree of an alphabet with \(n\) symbols with relative frequencies \(1, 2, 4, ..., 2^{n-1}\).
Assume the message has the size \(m\) and has the same frequencies distribution as the alphabet that generated the tree.
</p>

<p>
Note that the distance of each leaf from the root is \(n-1, n-1, n-2, n-3, ..., 3, 2, 1\).
</p>

<p>
<code>encode</code> calls <code>encode-symbol</code> for each symbol of the message, that's \(m\) calls.
</p>

<p>
Around half of those calls would be for the most frequent symbol, a quarter for the second most frequent symbol and so on.
The expected depth \(d_a\) of each call then will be:
</p>

<p>
\[ d_a = \frac{1}{2} * 1 + \frac{1}{4} * 2 + \frac{1}{8} * 3 + ... + \frac{1}{2^{n-1}} * (n-1) + \frac{1}{2^n} * n = ... = 2 - (n+2)/2^n \]
</p>

<p>
If \(n\) is large enough, \(d_a \approx 2\), e.g. \(d_a \approx 1.99\) for \(n=10\).
</p>

<p>
Thus, on average a call to <code>encode-symbol</code> takes 2 iterations, for simplicity say each can take up to \(n\) steps to search symbols of that node, \(2n\) in total, that's \(O(n)\).
</p>

<p>
Thus, on average <code>encode</code> runs in \(O(mn)\) steps.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: LMG</p>
<p class="date">Created: 2023-06-11 Sun 22:23</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
